<template>
  <div class="home">
    <h1>書籍管理システム</h1>
    <div style="text-align: left">
      <h2>使い方</h2>
      <h3>ナビゲーションメニュー</h3>
      <ul>
        <li>ページ上部のナビゲーションメニューから各ページへ移動できます。</li>
        <li>現在表示されているページへのリンクは色が変わります。</li>
      </ul>

      <h3>書籍検索ページ</h3>
      <ul>
        <li>登録済みの書籍一覧が表示されます。</li>
        <li>テキストボックスにタイトルの一部を入力し、<b>検索</b>ボタンを押すことで部分一致検索を行えます。</li>
        <li>書籍タイトルをクリックすると書籍詳細ページに移動します。</li>
      </ul>

      <h3>著者検索ページ</h3>
      <ul>
        <li>登録済みの著者一覧が表示されます。</li>
        <li>テキストボックスに氏名の一部を入力し、<b>検索</b>ボタンを押すことで部分一致検索を行えます。</li>
        <li>著者氏名をクリックすると著者詳細ページに移動します。</li>
      </ul>

      <h3>書籍登録ページ</h3>
      <ul>
        <li>書籍の各項目を入力し、<b>登録</b>ボタンを押すことで書籍の登録を行えます。</li>
        <li>【必須】と書かれている項目は入力必須項目です。</li>
        <li>出版日を過去の日付として登録できますが、その場合タイトルと出版日の変更は行えなくなります。</li>
        <li>登録に成功すると、書籍詳細ページに移動します。</li>
      </ul>

      <h3>書籍登録ページ</h3>
      <ul>
        <li>著者の各項目を入力し、<b>登録</b>ボタンを押すこと著者の登録を行えます。</li>
        <li>【必須】と書かれている項目は入力必須項目です。</li>
      </ul>

      <h3>書籍詳細ページ</h3>
      <h4>書籍基本情報</h4>
      <ul>
        <li>書籍の各情報と、書籍の著者一覧が表示されます。</li>
        <li>書籍の各情報はテキストボックスを編集し、<b>更新</b>ボタンを押すことで更新できます。</li>
        <li>出版済みの場合、タイトルと出版日を変更できません。</li>
        <li>出版日を過去の日付には変更できません。</li>
        <li>書籍の著者一覧の著者氏名をクリックすると著者詳細ページに移動します。</li>
        <li>書籍の著者一覧の<b>除外</b>をクリックすると書籍から著者を取り除けます。</li>
        <li><b>書籍を削除</b>ボタンを押すと書籍を削除できます。</li>
        <li>削除に成功すると、書籍検索ページに移動します。</li>
      </ul>
      <h4>著者を追加</h4>
      <ul>
        <li>登録済みで、この書籍の著者でない著者一覧が表示されます。</li>
        <li>テキストボックスに氏名の一部を入力し、検索ボタンを押すことで部分一致検索を行えます。</li>
        <li>著者氏名をクリックすると著者詳細ページに移動します。</li>
        <li><b>この著者を追加</b>をクリックするとこの書籍の著者に追加されます。</li>
      </ul>

      <h3>著者詳細ページ</h3>
      <h4>著者基本情報</h4>
      <ul>
        <li>著者の各情報が表示されます。</li>
        <li>著者の各情報はテキストボックスを編集し、<b>更新</b>ボタンを押すことで更新できます。</li>
      </ul>
      <h4>著書リスト</h4>
      <ul>
        <li>この著者の著書一覧が表示されます。</li>
        <li>書籍タイトルをクリックすると書籍詳細ページに移動します。</li>
      </ul>
    </div>
  </div>
</template>

<script>
export default {
  name: 'HomeView'
}
</script>
